org/2015-07-13-Bluetooth-Programming.org
#+TITLE: Bluetooth Programming
#+AUTHOR: Yang, Ying-chao
#+EMAIL:  yangyingchao[at]gmail[dot]com
#+KEYWORDS: (nil)
#+CATEGORY: (nil)
#+DESCRIPTION: (nil)
#+OPTIONS:  ^:nil toc:2 H:3 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align nodlcheck oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+LANGUAGE:   en
#+EXCLUDE_TAGS: noexport

* Overview

蓝牙编程与网络编程很大程度上可以类比，但在下面的这些步骤中有所区别：

1. 选择通讯设备
2. 选择如何与之交互
3. 发起对外链接
4. 发送数据
5. 接收数据。

* 选择通讯设备

每个网卡都有一个全球唯一的 MAC 地址，与之类似，每个蓝牙设备都有一个全球唯一的，长度为
 48 bit 的蓝牙地址（或者称为设备地址）。该地址在蓝牙编程中，作为基础的寻址单元。

 一个蓝牙设备只有想办法得到另外一个设备的地址才能与之通讯，该地址在蓝牙通讯的从上到下
 的所有层都会用到。类似的，网络编程中， 网络上 的两个终端也必须知道对方的 MAC 地址才能
 通讯。但不同的是，网络通讯中， MAC 地址仅限于链路层，而链路层之上的各层则使用 IP 寻址。
 尽管如此，两者在原理上都是一样的：必须能够唯一的确定对端，才能与之正常通讯。

 蓝牙通讯和网络通讯中，客户端程序通常并不直接知道对方的地址。网络通讯中，用户通常通过
 DNS 来解析主机名来获取 MAC 地址。与之类似，蓝牙通讯中，我们一般给设备起个名字，然后客
 户端搜索附近的蓝牙设备，再将该名字转换称为设备地址。

* 选择传输协议
一旦客户端找到了对端的地址，客户端就可以选择传输协议了。与网络编程类似，蓝牙编程的传输
层也有多种协议。


** RFCOMM + TCP

RFCCOMM 最早是用来模拟 RS232 串口的，尽管如此，除去若干与网络编程无关的特性后， RFCOMM
和 TCP 很类似。所不同的是， TCP 支持多达 65536 个端口，而 RFCOMM 仅仅支持 30 个。

** L2CAP + UDP

| Requirement             | Internet | Bluetooth                                |
|-------------------------+----------+------------------------------------------|
| Reliable, streams-based | TCP      | RFCOMM                                   |
| Reliable, datagram      | TCP      | RFCOMM or L2CAP with infinite retransmit |
| Best-effort, datagram   | UDP      | L2CAP (0-1279 retransmit)                |
